{
  "format": "graph-model",
  "generatedBy": "2.19.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": {
    "inputs": {
      "student_features": {
        "name": "student_features:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "45" }] }
      }
    },
    "outputs": {
      "output_0": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "6" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "unknown",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "45" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "ConstantFolding/StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/truediv_recip",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "45" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "135" }, { "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }, { "size": "6" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "6" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "student_features",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }, { "size": "45" }] } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/Sub",
        "op": "Sub",
        "input": ["student_features", "unknown"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/truediv",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/Sub",
          "ConstantFolding/StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/truediv_recip"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/Square",
        "op": "Square",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/truediv"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/Abs",
        "op": "Abs",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/truediv"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/Log1p",
        "op": "Log1p",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/Abs"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/concat",
        "op": "ConcatV2",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/truediv",
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/Square",
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/Log1p",
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/concat/axis"
        ],
        "attr": {
          "N": { "i": "3" },
          "Tidx": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/concat",
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/Relu",
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/Relu",
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/mul"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/mul_1",
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/sub"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/add_1",
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/Relu",
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/mul"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/mul_1",
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/sub"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/add_1",
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/Relu",
          "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/Softmax",
        "op": "Softmax",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/BiasAdd"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": [
          "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/Softmax"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 2129 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "unknown", "shape": [1, 45], "dtype": "float32" },
        {
          "name": "ConstantFolding/StatefulPartitionedCall/student_career_recommendation_model_1/feature_normalization_1/truediv_recip",
          "shape": [1, 45],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/concat/axis",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/Cast/ReadVariableOp",
          "shape": [135, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/custom_feature_interaction_1/dense_1/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/Cast/ReadVariableOp",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_1_1/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/mul",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_1_1/batchnorm/sub",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/Cast/ReadVariableOp",
          "shape": [128, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_2_1/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/mul",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/batch_norm_2_1/batchnorm/sub",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/Cast/ReadVariableOp",
          "shape": [64, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/dense_3_1/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/Cast/ReadVariableOp",
          "shape": [32, 6],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/student_career_recommendation_model_1/career_prediction_1/BiasAdd/ReadVariableOp",
          "shape": [6],
          "dtype": "float32"
        }
      ]
    }
  ]
}
